MusicApp/app/controllers/bands_controller.rb

    def update
        @band = Band.find(params[:id])

        if @band.update!(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Queen"], ["updated_at", "2021-09-22 01:29:00.030088"], ["id", 5]]