MusicApp/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "OaPmAxHfLWfmI5HqIRvIKA"], ["LIMIT", 1]]
---
    def destroy
        @user = User.find_by(session_token: session[:session_token])