MusicApp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def show
        @user = User.find_by(email: params[:email])